### Pyspark Handling Missing Values
- Dropping Columns
- Dropping Rows
- Various Parameter In Dropping functionalities
- Handling Missing values by Mean, Median and Mode

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Missing').getOrCreate()

In [3]:
df_spark = spark.read.csv('test3.csv',header=True, inferSchema=True)

In [4]:
df_spark.show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
|   null|  21|         2|  25000|
|   null|  25|         4|  35000|
+-------+----+----------+-------+

In [5]:
##drop the columns
df_spark.drop('Name').show()

+----+----------+-------+
| Age|Experience| Salary|
+----+----------+-------+
|  23|         5|  40000|
|  27|         6|  42000|
|  29|        10|  80000|
|  22|         2|  25000|
|  32|        15| 120000|
|null|      null|1000000|
|  36|        22| 150000|
|  21|         2|  25000|
|  25|         4|  35000|
+----+----------+-------+

In [6]:
df_spark.show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
|   null|  21|         2|  25000|
|   null|  25|         4|  35000|
+-------+----+----------+-------+

In [7]:
df_spark.na.drop().show() ## how = "any" is default

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 23|         5| 40000|
|   Sham| 27|         6| 42000|
|  Teena| 29|        10| 80000|
|  Meena| 22|         2| 25000|
|  Reena| 32|        15|120000|
|Shankar| 36|        22|150000|
+-------+---+----------+------+

In [8]:
## how = 'any'
df_spark.na.drop(how="any").show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 23|         5| 40000|
|   Sham| 27|         6| 42000|
|  Teena| 29|        10| 80000|
|  Meena| 22|         2| 25000|
|  Reena| 32|        15|120000|
|Shankar| 36|        22|150000|
+-------+---+----------+------+

In [9]:
df_spark.show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
|   null|  21|         2|  25000|
|   null|  25|         4|  35000|
+-------+----+----------+-------+

In [10]:
### threshold
df_spark.na.drop(how='any',thresh=3).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|    Ram| 23|         5| 40000|
|   Sham| 27|         6| 42000|
|  Teena| 29|        10| 80000|
|  Meena| 22|         2| 25000|
|  Reena| 32|        15|120000|
|Shankar| 36|        22|150000|
|   null| 21|         2| 25000|
|   null| 25|         4| 35000|
+-------+---+----------+------+

In [11]:
## subset
df_spark.na.drop(how='any',subset=['Name']).show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
+-------+----+----------+-------+

In [12]:
df_spark.show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
|   null|  21|         2|  25000|
|   null|  25|         4|  35000|
+-------+----+----------+-------+

In [14]:
###fill the missing values
df_spark.na.fill('Missing Values').show()

+--------------+----+----------+-------+
|          Name| Age|Experience| Salary|
+--------------+----+----------+-------+
|           Ram|  23|         5|  40000|
|          Sham|  27|         6|  42000|
|         Teena|  29|        10|  80000|
|         Meena|  22|         2|  25000|
|         Reena|  32|        15| 120000|
|          Shiv|null|      null|1000000|
|       Shankar|  36|        22| 150000|
|Missing Values|  21|         2|  25000|
|Missing Values|  25|         4|  35000|
+--------------+----+----------+-------+

In [16]:
df_spark.na.fill('Missing Values',['Age','Name']).show()

+--------------+----+----------+-------+
|          Name| Age|Experience| Salary|
+--------------+----+----------+-------+
|           Ram|  23|         5|  40000|
|          Sham|  27|         6|  42000|
|         Teena|  29|        10|  80000|
|         Meena|  22|         2|  25000|
|         Reena|  32|        15| 120000|
|          Shiv|null|      null|1000000|
|       Shankar|  36|        22| 150000|
|Missing Values|  21|         2|  25000|
|Missing Values|  25|         4|  35000|
+--------------+----+----------+-------+

In [17]:
df_spark.show()

+-------+----+----------+-------+
|   Name| Age|Experience| Salary|
+-------+----+----------+-------+
|    Ram|  23|         5|  40000|
|   Sham|  27|         6|  42000|
|  Teena|  29|        10|  80000|
|  Meena|  22|         2|  25000|
|  Reena|  32|        15| 120000|
|   Shiv|null|      null|1000000|
|Shankar|  36|        22| 150000|
|   null|  21|         2|  25000|
|   null|  25|         4|  35000|
+-------+----+----------+-------+

In [18]:
### handling missing values by mean, median, mode
from pyspark.ml.feature import Imputer
imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
    ).setStrategy("mean")

In [19]:
# Add imputation cols to df
df_spark = imputer.fit(df_spark).transform(df_spark)

In [20]:
df_spark.show()

+-------+----+----------+-------+-----------+------------------+--------------+
|   Name| Age|Experience| Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+-------+-----------+------------------+--------------+
|    Ram|  23|         5|  40000|         23|                 5|         40000|
|   Sham|  27|         6|  42000|         27|                 6|         42000|
|  Teena|  29|        10|  80000|         29|                10|         80000|
|  Meena|  22|         2|  25000|         22|                 2|         25000|
|  Reena|  32|        15| 120000|         32|                15|        120000|
|   Shiv|null|      null|1000000|         26|                 8|       1000000|
|Shankar|  36|        22| 150000|         36|                22|        150000|
|   null|  21|         2|  25000|         21|                 2|         25000|
|   null|  25|         4|  35000|         25|                 4|         35000|
+-------+----+----------+-------+-----------+------------------+--------------+

In [21]:
## change the null value in name = missing name
df_spark = df_spark.na.fill('Missing name')

In [22]:
df_spark.show()

+------------+----+----------+-------+-----------+------------------+--------------+
|        Name| Age|Experience| Salary|Age_imputed|Experience_imputed|Salary_imputed|
+------------+----+----------+-------+-----------+------------------+--------------+
|         Ram|  23|         5|  40000|         23|                 5|         40000|
|        Sham|  27|         6|  42000|         27|                 6|         42000|
|       Teena|  29|        10|  80000|         29|                10|         80000|
|       Meena|  22|         2|  25000|         22|                 2|         25000|
|       Reena|  32|        15| 120000|         32|                15|        120000|
|        Shiv|null|      null|1000000|         26|                 8|       1000000|
|     Shankar|  36|        22| 150000|         36|                22|        150000|
|Missing name|  21|         2|  25000|         21|                 2|         25000|
|Missing name|  25|         4|  35000|         25|                 4|         35000|
+------------+----+----------+-------+-----------+------------------+--------------+

### Great